/*2.	 Опишите класс fraction, у которого есть одно закрытое целочисленное поле chislo типа double.  Перегрузите для этого класса 
арифметические операции сложения, вычитания, умножения и деления так, чтобы они могли оперировать как с объектами класса, так и с
числами (то есть выполнять, например, не только действие 3/4 +2/5, но и 1/2 + 4 или 2* 5/6). Также перегрузите унарную операцию 
инкремента в префиксной и постфиксной форме увеличения дроби. Продемонстрируйте работу класса. Используйте конструктор по умолчанию
и конструктор с одни аргументом для инициализации поля класса.*/
